In [ ]:
import pandas as pd

In [2]:
estudiantes = pd.read_csv('estudiantes.csv')
print(estudiantes)

       NOMBRE  EDAD GENERO                 CARRERA SEMESTRE
0      Victor    23      M          Diseño Grafico  Segundo
1      Josefa    15      F  Desarrollo de software  Primero
2        Raul    30      M          Diseño Grafico  Tercero
3     Nayrobi    20      F              Enfermeria  Primero
4   Anastasia    40      F             Gastronomia  Segundo
5     Rolando    40      M           Audiovisuales  Segundo
6      Carlos    15      M           Audiovisuales  Segundo
7       Pedro    13      M  Desarrollo de software  Primero
8       Julio    25      M             Gastronomia  Segundo
9    Isabella    68      F              Enfermeria  Primero
10     Susana    77      F              Enfermeria  Primero
11   Fernando    33      M  Desarrollo de software  Primero

In [3]:
estudiantes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   NOMBRE    12 non-null     object
 1   EDAD      12 non-null     int64
 2   GENERO    12 non-null     object
 3   CARRERA   12 non-null     object
 4   SEMESTRE  12 non-null     object
dtypes: int64(1), object(4)
memory usage: 612.0+ bytes

In [5]:
estudiantes.head(8)

      NOMBRE  EDAD GENERO                 CARRERA SEMESTRE
0     Victor    23      M          Diseño Grafico  Segundo
1     Josefa    15      F  Desarrollo de software  Primero
2       Raul    30      M          Diseño Grafico  Tercero
3    Nayrobi    20      F              Enfermeria  Primero
4  Anastasia    40      F             Gastronomia  Segundo
5    Rolando    40      M           Audiovisuales  Segundo
6     Carlos    15      M           Audiovisuales  Segundo
7      Pedro    13      M  Desarrollo de software  Primero

In [6]:
estudiantes.tail()

      NOMBRE  EDAD GENERO                 CARRERA SEMESTRE
7      Pedro    13      M  Desarrollo de software  Primero
8      Julio    25      M             Gastronomia  Segundo
9   Isabella    68      F              Enfermeria  Primero
10    Susana    77      F              Enfermeria  Primero
11  Fernando    33      M  Desarrollo de software  Primero

In [ ]:
#Filtrar datos segun posicion o segun el nombre: iloc([indicefila, indicecolumna]),loc(indicefila,nombre_columna)

In [12]:
#iloc
estudiantes.iloc[3:6,0:3]

      NOMBRE  EDAD GENERO
3    Nayrobi    20      F
4  Anastasia    40      F
5    Rolando    40      M

In [10]:
#loc

estudiantes.loc[3:6,['NOMBRE', 'EDAD', 'GENERO']]

      NOMBRE  EDAD GENERO
3    Nayrobi    20      F
4  Anastasia    40      F
5    Rolando    40      M
6     Carlos    15      M

In [ ]:
# Filtrar informacion de solo Anastasia

estudiantes[estudiantes['NOMBRE'] == 'Anastasia']
estudiantes.iloc[4,0:4]

      NOMBRE  EDAD GENERO      CARRERA SEMESTRE
4  Anastasia    40      F  Gastronomia  Segundo

In [14]:
#Filtrar hombres mayores de 30

estudiantes[(estudiantes['GENERO'] == 'M') & (estudiantes['EDAD'] > 30)]

      NOMBRE  EDAD GENERO                 CARRERA SEMESTRE
5    Rolando    40      M           Audiovisuales  Segundo
11  Fernando    33      M  Desarrollo de software  Primero

In [16]:
#edad promedio
#edad maxima
#edad minima
#desviacion standar edad


print('Edad promedio:', estudiantes['EDAD'].mean())
print('Edad máxima:', estudiantes['EDAD'].max())
print('Edad mínima:', estudiantes['EDAD'].min())
print('Desviación estándar de edad:', estudiantes['EDAD'].std())

Edad promedio: 33.25
Edad máxima: 77
Edad mínima: 13
Desviación estándar de edad: 20.556463261421744

In [ ]:
estudiantes = {"Nombre": ["Laura", "Fernando", "Pedro"],
               "ocupacion":["Docente", "Futbolidta", "Entrenador"]}

df = pd.DataFrame(estudiantes)
df